{"sections":{"slideshow_DnDiVm":{"type":"slideshow","blocks":{"image_P3gwpG":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/Untitled_ef0f1adf-5479-46b0-a21a-39ae44397175.png","mobile_image":"shopify:\/\/shop_images\/Untitled_e56aabb2-b7a1-4af2-b7c7-67630919e5ef.png","show_overlay":false,"overlay_opacity":30,"text_color":"#000000","title":"The Skyward Standard","content":"Allowing our customers to speak for us is the best way \nto acquaint yourself with who we are.","content_position":"middle_left","button_background":"#ffffff","button_text_color":"#000000","button_text":"Button","link":""}}},"block_order":["image_P3gwpG"],"settings":{"edge_to_edge":false,"section_size":"preserve_ratio","carousel_effect":"slide","autoplay":true,"cycle_speed":5}},"main":{"type":"main-page","settings":{}},"image_with_text_7q6QzL":{"type":"image-with-text","settings":{"image":"shopify:\/\/shop_images\/pexels-mikhail-nilov-8317651.jpg","image_position":"left","image_width":50,"title":"View a Few of our Highlighted Reviews","content":"<p><strong>Great experience with bed and company<\/strong><br\/>\"<em>We purchased this bed for elderly mother with Parkinsons. It has been a great help! We can get her in and out of bed without rolling or pulling on her. The motor does move rather slow and pauses. When I contacted customer service they were very helpful. They investigated said the slow movement is for safety reasons. It works well and after our first week of using it we have it better figured out and it has proved very helpful. The mattress is comfortable and mom sleeps well. I am thankful we found it.<\/em>\"<\/p><p>Tracy H.<\/p><p><strong>PPU-S - highly recommended!<\/strong><\/p><p>\"<em>Excellent! We’ve had this for a few days, but ideal (at age 75); to assist my husband (ALS) to transfer from chair, settee, tub bench, toilet, etc., to wheelchair. We have yet to try lift to truck seat but dont anticipate any issues! Might be easier to move if handles were lower - still very easy in lowest position. No stress, no falls, no pulled muscles, safe\/easy to use!<\/em>\"<\/p><p>Mark M. <\/p><p><strong>Free Assembly<\/strong><\/p><p>\"<em>It was a hassle-free experience for me as a customer, and the FREE assembly not only saved me some money, time, and effort of figuring out the setup process but also gave me peace of mind knowing that professionals were handling it. The attention to detail during assembly highlighted Skyward Medical and Dawn House's commitment to delivering a premium experience.<\/em>\"<\/p><p>Heather R.<br\/><\/p>","button_text":"","button_link":"shopify:\/\/collections\/all"}}},"order":["slideshow_DnDiVm","main","image_with_text_7q6QzL"]}