{"sections":{"main":{"type":"main-page","settings":{}},"image_with_text_PaM6Y7":{"type":"image-with-text","settings":{"image":"shopify:\/\/shop_images\/Screenshot_2024-08-16_165345-removebg-preview.png","image_position":"right","image_width":45,"title":"Step-by-Step of What to Expect During a White Glove Delivery","content":"<ul><li><strong>Step One:<\/strong> Your item departs from the manufacturer's warehouse.<\/li><li><strong>Step Two:<\/strong> It is then delivered to a local White Glove agent.<\/li><li><strong>Step Three:<\/strong> The White Glove agent contacts you to arrange the delivery schedule.<\/li><li><strong>Step Four: <\/strong>Finally, your item is delivered to your home and expertly set up for your convenience.<\/li><\/ul>","button_text":"","button_link":"shopify:\/\/collections\/all"}},"collection_list_Pwnx7b":{"type":"collection-list","blocks":{"collection_wLBPYt":{"type":"collection","settings":{"collection":"adjustable-beds","image":"shopify:\/\/shop_images\/Screenshot_2024-05-13_103710.jpg","link":""}},"collection_Dp9ncR":{"type":"collection","settings":{"collection":"fluid-immersion-simulation-mattress-systems","image":"shopify:\/\/shop_images\/Screenshot_2024-05-13_103757.jpg","link":""}},"collection_xdXdfT":{"type":"collection","settings":{"collection":"outdoor-saunas","link":""}},"collection_UNJHQc":{"type":"collection","settings":{"collection":"pediatric-safety-beds","link":""}}},"block_order":["collection_wLBPYt","collection_Dp9ncR","collection_xdXdfT","collection_UNJHQc"],"disabled":true,"settings":{"title":"Products Eligible for White Glove Delivery","link_title":"","link":"shopify:\/\/collections","round_images":false,"show_collection_title":true}},"faq_63TkDj":{"type":"faq","blocks":{"separator_LdhkVA":{"type":"separator","settings":{"title":"Skyward Medical White Glove Delivery Details"}},"question_NcVGKf":{"type":"question","settings":{"title":"What is White Glove Delivery?","answer":"<p>White Glove Delivery, an exclusive option for select items, ensures your new purchase is seamlessly integrated into your home. When you opt for White Glove Delivery, your product is delivered at your chosen time, set up in your preferred location, thoroughly tested, and all packaging materials are taken away.<\/p><p>This service is particularly beneficial for individuals seeking extra assistance with the delivery and setup of items like Homecare Beds. Skyward Medical highly recommends White Glove Delivery for those sending products to out-of-town relatives or friends who require help with unpacking and setup.<\/p><p>Here's what you can anticipate with White Glove Delivery:<\/p><ul><li>Your product is shipped from the manufacturer to a local agent.<\/li><li>The agent meticulously inspects the product to ensure its pristine condition and proper functionality.<\/li><li>You're contacted by the agent to arrange a convenient delivery time.<\/li><li>At the agreed-upon time, the agent will arrive and assemble your product(s) to satisfaction.<\/li><\/ul><p>Please be aware that White Glove Delivery typically extends the total delivery time by 5-7 days. However, this duration may vary or be unavailable in certain remote or rural areas.<\/p>"}},"question_7aHEBE":{"type":"question","settings":{"title":"How can I prepare for delivery?","answer":"<p>Before your White Glove Delivery, it's important to take a few preparatory steps:<\/p><p><strong>Contact Phone Number: <\/strong>Make sure that Skyward Medical has your current and best contact phone number. Some individuals may prefer that a loved one or caregiver be contacted to assist with the delivery process.<br\/><br\/><strong>Clear a Path:<\/strong> Examine the route from the entry door to the delivery area. Remove or secure any obstacles such as rugs, cables, cords, gates, or other items that could potentially cause the White Glove Agent to trip during delivery.<br\/><br\/><strong>Pets: <\/strong>While we adore your furry companions, please ensure they are safely removed from the delivery area. This ensures the safety of both your pets and our agents.<br\/><br\/><strong>Be Present for Delivery: <\/strong>Agree upon a delivery time with the White Glove Agent and ensure that an authorized adult aged 18 or older is available to accept the delivery. Our agents are unable to leave your unit outside or in any unsecured areas.<br\/><br\/><strong>Packaging:<\/strong> If you have any doubts about the product once it's unboxed, ask your delivery agent to retain the packaging or store it for you. This packaging may be necessary if you decide to return the product. Many of our items are shipped on pallets with large boxes and strapping, which can be costly to replace if needed.<\/p>"}},"question_GgbCiM":{"type":"question","settings":{"title":"How will I know when my order ships?","answer":"<p>Upon shipment of your item, you will promptly receive an email notification. Your item will then be dispatched directly to your designated White Glove Agent. Upon receipt, the agent will meticulously inspect the item for any shipping-related damages. Subsequently, your White Glove Agent will personally contact you to coordinate a suitable delivery time.<\/p>"}}},"block_order":["separator_LdhkVA","question_NcVGKf","question_7aHEBE","question_GgbCiM"],"settings":{"show_contact_info":true,"contact_info_heading":"Any questions?","contact_info_text":"<p>If we still haven't answered your questions, you can contact us below and we will get back to you as soon as possible.<\/p>","contact_1_icon":"bi-phone","contact_1_heading":"Customer support","contact_1_text":"<p>(855) 244-4712<\/p>","contact_2_icon":"bi-email","contact_2_heading":"Send a message","contact_2_text":"<p>support@skywardmedical.com<\/p>"}}},"order":["main","image_with_text_PaM6Y7","collection_list_Pwnx7b","faq_63TkDj"]}