{"sections":{"main":{"type":"main-page","settings":{}},"image_with_text_cknhmf":{"type":"image-with-text","settings":{"image":"shopify:\/\/shop_images\/IMG-20200123-WA0003_002.jpg","image_position":"right","image_width":50,"title":"Meet Consumer Priority Service","content":"<p><strong>Mission Statement<\/strong><br\/>At Consumer Priority Service, we strive to provide the ultimate warranty service plan experience. With complete online control, valuable information and tools, and a commitment to delivering the best service possible, our mission is clear: to give you the peace of mind you deserve with your purchases. We're not just a warranty company; we're your partner in protection, and our \"AM Best A-\" rating ensures you're in good hands.<br\/><br\/><strong>Best In Class<\/strong><br\/>Consumer Priority Service has grown to become a leader by providing creative warranty solutions with a consistent pattern of growth. CPS has also developed a definable record of value for clients by empowering a continual process of internal and external customer centric development.<\/p>","button_text":"","button_link":"shopify:\/\/collections\/all"}},"rich_text_nr88Q3":{"type":"rich-text","settings":{"text_width":"narrow","title":"Why Choose CPS?","content":"","button_text":"","button_link":"shopify:\/\/collections\/all"}},"offers_NJbAYJ":{"type":"offers","blocks":{"offer_7pQCpD":{"type":"offer","settings":{"title":"Variety of Coverage Options","content":"<p>CPS is a leader and innovator in the field of service plans. The company offers extended warranty coverage for virtually all high ticket consumer purchases ranging from high-end consumer electronics to computers, major appliances, power tools, lawn & garden equipment, and more. All plans are backed by an A.M. Best rating of \"A-\" (Excellent) insurance carrier.<\/p>"}},"offer_UXEwca":{"type":"offer","settings":{"title":"Hassle-Free Experience","content":"<p>We have one goal in mind – to give the customer the ultimate service plan experience. This means complete, hassle-free, on-line control – from updating your service plan’s information to scheduling and tracking the progress of service calls or claims. This also means giving you valuable information and tool to use, like on-line copies of your product(s) user’s manual (as available from your product’s manufacturer), preventative maintenance tips, notification of product recalls and much more.<\/p>"}},"offer_Na9WcA":{"type":"offer","settings":{"title":"Strong Foundation","content":"<p>Our company was built on the foundation that customers always deserve better service. By following through and providing a \"best-in-class\" service, Consumer Priority Service is quickly becoming the first choice among retailers, e-commerce and manufacturers alike. We provide: Extended, In-home Extended, Date of Purchase, Accidental Damage, and OEM Parts and Labor Service Plans. We cover products that are new, scratched and dented or refurbished.<\/p>"}},"offer_ARMrdW":{"type":"offer","settings":{"title":"Large Service Area","content":"<p>CPS has the capacity to provide top quality service to the entire United States market. This means that no matter where you are located, you can expect to receive the same level of service. With a large database of parts at their disposal, CPS is able to easily diagnose and repair a vast array of product types, from homecare beds to mobility scooters. Of course none of this would be possible without their professional and talented service team.<\/p>"}}},"block_order":["offer_7pQCpD","offer_UXEwca","offer_Na9WcA","offer_ARMrdW"],"settings":{"items_per_row":2,"stack_mobile":false}},"faq_7tFL6A":{"type":"faq","blocks":{"separator_X6tgxc":{"type":"separator","settings":{"title":"Skyward Medical & CPS Details"}},"question_BTgJ8q":{"type":"question","settings":{"title":"Why has Skyward Medical partnered with CPS?","answer":"<p>CPS provides an often overlooked need in the medical and homecare sphere, extended coverage and service. Even though every manufacturer has a standard warranty, most don't offer extended protection, and even fewer service their products. All of this is possible with CPS.<\/p>"}},"question_djceLT":{"type":"question","settings":{"title":"Does CPS cover every product?","answer":"<p>The short answer is not every product, however for the majority products on the market, CPS will cover and service. It largely depends on the type of product and what parts are available in their database. <\/p>"}},"question_QURyGc":{"type":"question","settings":{"title":"How do I apply the CPS coverage to my product?","answer":"<p>CPS has conveniently integrated their coverage tiers onto Skyward Medical's product pages. This way you can easily add your coverage at time of purchase. <\/p>"}},"question_iCPKbB":{"type":"question","settings":{"title":"How do I file a claim?","answer":"<p>In the event you need to file a claim, you can contact CPS directly and all you need to provide is your warranty #, a copy of your receipt, a description of the problem, and the date it occurred. You can follow this <a href=\"https:\/\/www.cpscentral.com\/how-to-file-a-claim\/\" title=\"CPS Claims Webpage\"><em><strong>link<\/strong><\/em><\/a> to their claims page.<\/p>"}}},"block_order":["separator_X6tgxc","question_BTgJ8q","question_djceLT","question_QURyGc","question_iCPKbB"],"settings":{"show_contact_info":true,"contact_info_heading":"Further Questions?","contact_info_text":"<p>If we still haven't answered your question, you can contact us below and we will get back to you as soon as possible.<\/p>","contact_1_icon":"bi-phone","contact_1_heading":"Customer support","contact_1_text":"<p>(855) 244-4712<\/p>","contact_2_icon":"bi-email","contact_2_heading":"Send a message","contact_2_text":"<p>support@skywardmedical.com<\/p>"}}},"order":["main","image_with_text_cknhmf","rich_text_nr88Q3","offers_NJbAYJ","faq_7tFL6A"]}