/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "ad91ba94-88d8-446b-be07-0dcd4394f416": {
      "type": "banner",
      "settings": {
        "show_announce": false,
        "email": "support@skywardmedical.com",
        "telephone": "FREE SHIPPING",
        "bg_color": "#1e2d7d",
        "icon_color": "#102c71",
        "buttonBackground": "#2091ff",
        "textColor": "#ffffff",
        "buttonName": "TRUSTED STORE [Learn More]",
        "buttonUrl": "https://skywardmedical.com/pages/skyward-medical-is-a-google-trusted-store"
      }
    },
    "main": {
      "type": "main-product",
      "blocks": {
        "product_meta": {
          "type": "product_meta",
          "settings": {
            "show_vendor": false,
            "show_sku": true,
            "show_reviews_badge": false,
            "show_share_buttons": false
          }
        },
        "ymq_product_options_variants_option_cWgJqT": {
          "type": "shopify://apps/ymq-product-options-variants/blocks/option/86b91121-1f62-4e27-9812-b70a823eb918",
          "settings": {
            "product": "{{product}}"
          }
        },
        "variant_selector": {
          "type": "variant_selector",
          "settings": {
            "selector_mode": "block",
            "color_mode": "color",
            "show_quantity_selector": false,
            "show_taxes_included": false,
            "show_inventory_quantity": false,
            "low_inventory_threshold": 0
          }
        },
        "7ef4136f-49dc-4aa4-ba22-a97b29304c71": {
          "type": "shopify://apps/essential-trust-badges/blocks/app-block/0ff65b25-07e1-408e-950f-f54dd3d1751b",
          "settings": {
            "banner_display": "all",
            "banner_id": ""
          }
        },
        "text_tUf3rC": {
          "type": "text",
          "settings": {
            "content": "<p><strong>✔</strong> <strong>FREE Delivery </strong></p><p><strong>✔</strong> <strong>Delivery Window: </strong>Please allow up to 1.5 weeks.</p><p><strong>✔ Top Eurolux Living Supplier</strong></p><p><strong>✔ Manufacturer's Warranty</strong></p>"
          }
        },
        "buy_buttons": {
          "type": "buy_buttons",
          "settings": {
            "show_payment_button": false,
            "show_payment_button_fullwidth": true
          }
        },
        "description": {
          "type": "description",
          "settings": {
            "display_mode": "show_all"
          }
        },
        "trust_badge_with_content_U7UVKf": {
          "type": "trustBadge_with_content",
          "settings": {
            "trustBadge_richtext": "",
            "trustBadge_faq_title": "",
            "trustBadge_faq": "<p>☑ type content</p>"
          }
        }
      },
      "block_order": [
        "product_meta",
        "ymq_product_options_variants_option_cWgJqT",
        "variant_selector",
        "7ef4136f-49dc-4aa4-ba22-a97b29304c71",
        "text_tUf3rC",
        "buy_buttons",
        "description",
        "trust_badge_with_content_U7UVKf"
      ],
      "settings": {
        "image_size": "medium",
        "enable_video_looping": false,
        "enable_image_zoom": true,
        "zoom_effect": "outside",
        "carousel_effect": "fade"
      }
    },
    "faq_tzPJPi": {
      "type": "faq",
      "blocks": {
        "separator_nxUcCa": {
          "type": "separator",
          "settings": {
            "title": "Frequently Asked Questions"
          }
        },
        "question_LFwgfi": {
          "type": "question",
          "settings": {
            "title": "WHY ARE YOUR MATTRESSES CONSIDERED NATURAL OR ECO-FRIENDLY?",
            "answer": "<p>We use over 80% natural materials in every product.  The reason we do not produce products with a higher % of natural materials is due to the risk that 100% natural products have for developing mold, mildew and bacteria.  Many companies falsely state they use 100% natural materials but in every case the true % of natural component is below 70% and in some cases they have used a treatment which is far from natural to avoid issues with mold and mildew.<br/><br/>We also put a great deal of importance towards maximizing the durability and comfort of our products.  We have developed a perfect synergy between durability, comfort and green materials.  In the US, companies can legally state that their product is “all natural” when in reality they only need to be using 70% natural materials (in Europe it is 80%).  As a policy we want to be as transparent and black and white with our clients so we will never use creative adjectives or titles to describe our materials and components.  We want every client to know exactly what they are getting and what they are sleeping on.</p>"
          }
        },
        "question_V7QXAR": {
          "type": "question",
          "settings": {
            "title": "DOES THE SOY-BASED MEMORY FOAM USED IN YOUR PRODUCTS FEEL LIKE NORMAL MEMORY FOAM?",
            "answer": "<p>Our similarity to typical memory foam ends in the name.  Our memory foam is one of the greenest products in the market, which means that it does not heat up, smell or off gas and it is free of any harmful toxins and chemicals.  We use a type of Soy based memory foam composed of almost 50% Natural Component.  In the case of the Lux with a core of Soy Based memory foam and Soy based foam, it does not need to be rotated or flipped and it outlasts almost any other mattress in the market with a 15-20+ year life span under normal conditions (average life span in the industry has dropped to 1-5 years).  Additionally our products feel different than the typical memory foams found in the US, since we offer more support and comfort for the ultimate sleep experience.  The Quietud mattress has a cushioned top so the feels more like a pillow top while still offering superior support.  The Thermovisco is the firmest of our mattress options which can be compared to the firm or extra firm Lux.  The Green planet pillow is lighter than almost all of the pillows in it’s category and has a perfect level of density.</p>"
          }
        },
        "question_Emx3H9": {
          "type": "question",
          "settings": {
            "title": "WHAT IS YOUR MATTRESS MADE OF AND WHERE IS IT MANUFACTURED?",
            "answer": "<p>Our mattresses are all produced in Spain in a small town close to Madrid.<br/><br/>Our Prive and Natur mattress models are handmade with Natural Viscose, Natural Talalay Latex, Cashmere, Silk, Mohair, Pocketed Coil System, Wool, and Cotton.<br/><br/>Our Novis mattresses are made with Natural Talalay Latex, Silk, Mohair and Pocketed Coils.<br/><br/>Our Lux by Naturalia mattress is made with Soy-based memory foam with almost 50% Soy and Soy-based foam, Cashmere, Cotton and Bamboo.<br/><br/>Our Harmony mattress is made with Italian Fabrics and Italian Foam, German Pocketed Micro-coils and Coils, Swiss AventO2 technology, and Viscotermic Comfort Technology.<br/><br/>Our Multisens mattress is made with Italian Fabrics and Italian Foam, German Pocketed Coils, Swiss AventO2 technology, and Viscotermic Comfort Technology.<br/><br/>Our Quietud mattress is made with Cashmere, Soy-based memory foam with almost 50% Soy and Soy-based foam, Bamboo, and a Pocketed Coil System.<br/><br/>Our Thermovisco mattress is made with Soy-based memory foam with almost 50% Soy and Soy-based foam, Bamboo, Politex and Stretch Fabric.<br/><br/>Our Green Planet pillow is made with Soy-based memory foam with almost 50% Soy and Soy-based foam, Cashmere, Cotton and Bamboo. They also include aromatherapy essential oils from Tropical Africa like Coconut, Aloe Vera, Bamboo and Verenda.<br/><br/>Our Memory Restore Travel Pillows are made with high quality memory foam and a 3D Bamboo outer cover.<br/><br/>Our Cervical Pillow is made with high quality memory foam and a Cool Sensitive cover infused with Aloe Vera.</p>"
          }
        },
        "question_M6eBth": {
          "type": "question",
          "settings": {
            "title": "ARE YOUR PRODUCTS CERTIFIED ORGANIC OR WHAT OTHER CERTIFICATIONS DO YOU OFFER?",
            "answer": "<p>Organic certifications hold much more weight in other countries but sadly in the US those certifications many times are not even worth the paper they are written on and “Green Washing” is rampant. There are too many ways to deceive the consumer. Several of these certifications do not even require testing or the submission of samples. Some companies take advantage of this to certify one of their materials and then claim the whole product is certified. Some global certifications and specifically European certifications are much more stringent and truly do demand that products be tested and those certifications need to be renewed frequently and those standards must always be adhered to. The Oeko-Tex certification is the world wide gold standard for products found to be free of Toxins and Chemicals and those that have achieved the highest level of Oeko-Tex certification are certified to be safe for exposure to toddlers and babies. We strive to use only the highest level of Oeko-Tex certified materials in all of our products. We are also TUV certified and since our products are produced in Europe we are proud to offer a much more sustainable and earth friendly product always.</p>"
          }
        },
        "question_UVMiDV": {
          "type": "question",
          "settings": {
            "title": "IF I CAN'T TRY YOUR PRODUCT (MATTRESS AND PILLOWS) HOW DO I KNOW WHAT IT FEELS LIKE?",
            "answer": "<p>Our Lux by Naturalia models are considered memory foam but since they are state of the art technology they do not feel like your typical memory foam mattress. A typical foam mattress normally gives you a sinking feeling (silly puddy or playdo feel) and what some might say is like quicksand. Our Lux mattresses offer much more support. Clients describe it like this….”They give but at the same time they contour with your body and they offer more push back”. We get clients who describe the experience as the best sleeping experience they have ever had. Since we do offer personalized firmness levels people sometimes assume that a firmer mattress will be a longer lasting mattress. The firmness level has nothing to do with the durability. It is pure personal taste. If you prefer a medium feel…..we recommend our soft option and if you like the cushier experience you can add a pillow top cover. Most of our clients fall into the category of firm or soft. The extra firms are ordered very seldomnly and they tend to be for clients with serious back issues and who feel comfortable sleeping on the floor. Our Quietud models feel like the Lux medium-firm models but with a pillow top.<br/><br/>Our Thermovisco models are firm like the Lux Firm models.<br/><br/>Our Prive and Natur models are more designed to feel like a firm spring mattress (when used without the topper) but combined with some of the most luxurious materials to provide extra comfort for a blissful experience. If you require more cushion they come with a Symbiosis topper option which makes it feel very plush. With the topper they will feel like a pillow top luxury mattress. Without the topper they are quite firm. The Novis feels like the Prive with a Topper.<br/><br/>The Harmony can feel like a slightly plush spring mattress with a very good support. The Multisens is more firm while still offering the support.<br/><br/>Our Green Planet Pillow offers the perfect level of density, height and weight. We are one of the most light weight pillows in the market especially for a memory foam pillow. It took us decades to design the density of the pillow so you wouldn’t sink in or feel like you are sleeping on a rock. The height was designed for side sleepers or back sleepers. This model does not work well for sleepers who sleep face down but the Green Planet Jr can work with people who sleep face down or with short neck lines.<br/><br/>The Cervical Pillow is ideal for sleepers with neck issues. It is designed with the perfect height and curvature. It has a medium feel to it.</p>"
          }
        },
        "question_aFhk6n": {
          "type": "question",
          "settings": {
            "title": "HOW DO YOUR COSTS COMPARE TO SIMILAR PRODUCTS?",
            "answer": "<p>The cost of mattresses and pillows have dramatically increased in the last 10 years due to increased materials costs but we have barely been affected. Many leading manufacturers have dramatically cheapened the overall quality of their products while raising prices. We are one of the oldest and largest manufacturers in Europe and due to sheer volume and control over material production we can offer a superior product and a lower price. We often refer to what we offer as “attainable luxury”. Our Lux by Naturalia model can be it's own category of mattress but if you were to compare it to other mattresses, it would sell for 3 times it's current cost.<br/><br/>Pillows made with truly natural foam start at about $200-250 online and our models offer a much higher natural component at close to a third of the price. The Lux by Naturalia models were designed to have no competitor but if something similar were to exist the price for a king would be in the range of $15,000 – $18,000. Thanks to our advancements at factory level we are able to offer so many luxuries and attributes at a price between $3000 and $8000 per king.<br/><br/>The Prive and Natur models were initially inspired by other handmade models like Hastens, Vispring and Duxiana. Our goal was to develop the most luxurious and comfortable mattresses in the world. These models sell between $18,000 to $450,000 per king while our Prive, Natur and Novis models sell between $7000 and $12,500 per king.</p>"
          }
        },
        "question_i83Qpd": {
          "type": "question",
          "settings": {
            "title": "IS YOUR PRODUCT IDEAL FOR THE WAY I SLEEP? FACE DOWN? ON MY SIDE? WITH A CPAP? WITH MENOPAUSE OR NIGHT SWEATS?",
            "answer": "<p>Sleep is so relative to each consumer and no 2 people sleep the same. We have developed one of the most comprehensive collections of different feels and advanced materials to offer consumers whatever level they prefer.<br/><br/>Our Lux by Naturalia mattresses have different firmness levels so they are ideal for many different types of clients and sleep positions. For the consumer looking for the supportive Memory foam experience without the sinking feeling we offer a great deal of support and comfort and can even minimize bed sores for those clients who are bed ridden. Since the client can use the cooler side, the mattress is also ideal for people who suffer from menopause and night sweats. This models will give a medium to extra firm feel depending on the internal topper. The Prive, Natur with toppers and the Novis can offer a very plush feel. The Harmony and Quietud can be in the middle.<br/><br/>The Green Planet Pillow has a cooler side and a warmer side so it too is ideal for customers who have night sweats, CPAP machines or menopause to minimize the heat. It is the ideal level of weight and height to insure comfort and support for side sleepers or back sleepers. We do not recommend this pillows for clients who sleep face down. The Green Planet Junior offers clients who sleep face down or on their side but with a short neck a perfect alternative thanks to it's 3 inch height.</p>"
          }
        }
      },
      "block_order": [
        "separator_nxUcCa",
        "question_LFwgfi",
        "question_V7QXAR",
        "question_Emx3H9",
        "question_M6eBth",
        "question_UVMiDV",
        "question_aFhk6n",
        "question_i83Qpd"
      ],
      "settings": {
        "show_contact_info": true,
        "contact_info_heading": "",
        "contact_info_text": "",
        "contact_1_icon": "bi-phone",
        "contact_1_heading": "",
        "contact_1_text": "",
        "contact_2_icon": "bi-email",
        "contact_2_heading": "",
        "contact_2_text": ""
      }
    },
    "custom_liquid_9WigV4": {
      "type": "custom-liquid",
      "settings": {
        "title": "",
        "include_margins": true,
        "liquid": "<div class=\"rte\">\n{% if product.metafields.custom.uses_pagecrafters.value == true %}{{ product.description}} {% endif %}\n</div>"
      }
    },
    "1715483660158cc418": {
      "type": "apps",
      "blocks": {
        "fera_product_reviews_Kxfaxy": {
          "type": "shopify://apps/fera/blocks/product_reviews/2fbfcfa7-8a04-479f-89a8-0621fa099c51",
          "disabled": true,
          "settings": {
            "heading": "Product Reviews",
            "layout": "list",
            "star_color": "#ffda03",
            "when_no_reviews": "show"
          }
        }
      },
      "block_order": [
        "fera_product_reviews_Kxfaxy"
      ],
      "settings": {
        "include_margins": true
      }
    },
    "1669343322767881e2": {
      "type": "apps",
      "settings": {
        "include_margins": true
      }
    },
    "1d2d26bc-0af6-407a-916b-b128b3047c0c": {
      "type": "custom-liquid",
      "settings": {
        "title": "",
        "include_margins": true,
        "liquid": "<div class=\"product-bottom rte\">\n{{ product.metafields.custom.product_seo_text }}\n</div>"
      }
    },
    "product-recommendations": {
      "type": "product-recommendations",
      "settings": {
        "heading": "You may also like",
        "show_quick_buy": false
      }
    },
    "170370457993485f67": {
      "type": "apps",
      "settings": {
        "include_margins": true
      }
    }
  },
  "order": [
    "ad91ba94-88d8-446b-be07-0dcd4394f416",
    "main",
    "faq_tzPJPi",
    "custom_liquid_9WigV4",
    "1715483660158cc418",
    "1669343322767881e2",
    "1d2d26bc-0af6-407a-916b-b128b3047c0c",
    "product-recommendations",
    "170370457993485f67"
  ]
}
